[
  {
    "title": "What is the name of the PHP function used for encrypting data using a secure one-way hash algorithm?",
    "options": [
      "secure()",
      "lock()",
      "password_hash()",
      "crypt()"
    ],
    "answer": 2
  },
  {
    "title": "What is the name of the PHP function used for connecting to a MySQL database?",
    "options": [
      "mysql_connect()",
      "mysqli_connect()",
      "pdo_connect()",
      "mysql_select_db()"
    ],
    "answer": 1
  },
  {
    "title": "What is the name of the MySQL function used for returning the current date and time?",
    "options": [
      "NOW()",
      "CURRENT_TIMESTAMP()",
      "CURRENT_DATE()",
      "DATE()"
    ],
    "answer": 0
  },
  {
    "title": "What is the purpose of database normalization?",
    "options": [
      "Deadlock prevention",
      "Minimizes redundancies across relations",
      "Ensures indexes are optimized",
      "Prunes log files"
    ],
    "answer": 1
  },
  {
    "title": "What is the purpose of a load balancer?",
    "options": [
      "To distribute incoming requests to multiple backend servers to improve performance and availability",
      "To encrypt and decrypt data between the client and server",
      "To route incoming requests to the appropriate backend server based on the URL path",
      "To store session data for a specific user"
    ],
    "answer": 0
  },
  {
    "title": "What is the purpose of a containerization technology like Docker?",
    "options": [
      "To manage the state of an application and ensure that it is always running",
      "To store data in a structured format that can be easily queried and analyzed",
      "To encrypt and decrypt data between the client and server",
      "To package an application and its dependencies into a single image that can be run on any server that has Docker installed"
    ],
    "answer": 3
  },
  {
    "title": "What is the difference between horizontal scaling and vertical scaling in modern backend development?",
    "options": [
      "Horizontal scaling adds more servers to a cluster to handle more traffic, while vertical scaling increases the capacity of an individual server",
      "Vertical scaling adds more servers to a cluster to handle more traffic, while horizontal scaling increases the capacity of an individual server",
      "Horizontal scaling and vertical scaling are the same thing",
      "Horizontal scaling and vertical scaling both refer to adding more servers to a cluster to handle more traffic"
    ],
    "answer": 0
  },
  {
    "title": "What is the difference between an include and a require statement in PHP?",
    "options": [
      "An include and a require statement are the same thing",
      "An include and a require statement both produce a fatal error and stop executing the script if the file is not found",
      "An include statement will produce a warning and continue executing the script if the file is not found, while a require statement will produce a fatal error and stop executing the script",
      "A require statement will produce a warning and continue executing the script if the file is not found, while an include statement will produce a fatal error and stop executing the script"
    ],
    "answer": 2
  },
  {
    "title": "What is a prepared statement in PHP?",
    "options": [
      "A way to optimize SQL queries for better performance",
      "A way to prevent SQL injection attacks in a database",
      "A way to group related SQL queries together",
      "A way to create temporary tables in a database"
    ],
    "answer": 1
  },
  {
    "title": "What is the difference between an abstract class and an interface in PHP?",
    "options": [
      "An abstract class can have concrete methods, while an interface has method declarations",
      "An interface can have concrete methods, while an abstract class can only have abstract methods",
      "An abstract class and an interface are the same thing",
      "An abstract class and an interface can both have concrete methods"
    ],
    "answer": 0
  },
  {
    "title": "What is the purpose of the dd() helper function in Laravel?",
    "options": [
      "Dump and die",
      "Dump and debug",
      "Debug delimiter",
      "Debug verbosely"
    ],
    "answer": 0
  },
  {
    "title": "Which of the following is a widely used Python web framework?",
    "options": ["Blazor", "Laravel", "Express.js", "Flask"],
    "answer": 3
  },
  {
    "title": "What does SQL stand for?",
    "options": ["Structured Query Language", "Sequential Query Language", "Standard Query Language", "Static Query Language"],
    "answer": 0
  },
  {
    "title": "What does PHP stand for?",
    "options": ["PHP: Hypertext Preprocessor", "Personal Hypertext Processor", "Private Home Page", "Public Hosting Platform"],
    "answer": 0
  },
  {
    "title": "Which HTTP method is used to update data from on a server?",
    "options": ["GET", "POST", "PUT", "DELETE"],
    "answer": 2
  },
  {
    "title": "What is the purpose of a CDN (Content Delivery Network)?",
    "options": ["To host databases", "To store backend code", "To distribute website content", "To manage server configurations"],
    "answer": 2
  },
  {
    "title": "What does ORM stand for in the context of database management?",
    "options": ["Object-Relational Mapping", "Object-Reserved Model", "Object-Related Method", "Object-Resource Management"],
    "answer": 0
  },
  {
    "title": "What does PaaS stand for in cloud computing?",
    "options": ["Platform as a Service", "Private as a Service", "Programming as a Solution", "Public as a Service"],
    "answer": 0
  },
  {
    "title": "Which cloud computing service is known for its serverless computing platform called Firebase?",
    "options": ["AWS", "Azure", "Google Cloud Platform", "DigitalOcean"],
    "answer": 2
  },
  {
    "title": "Which architectural pattern involves dividing an application into distinct, interconnected layers, such as presentation, application, and data layers?",
    "options": ["Layered Architecture", "Distributed Architecture", "Client-Server Architecture", "Event-Driven Architecture"],
    "answer": 0
  },
  {
    "title": "What is the primary role of an API gateway in a microservices architecture?",
    "options": ["To manage authentication and authorization", "To provide data caching and rate limiting", "To orchestrate and route requests to appropriate services", "To handle client-side state management"],
    "answer": 2
  },
  {
    "title": "Which architectural pattern allows components to communicate with each other by sending and receiving messages?",
    "options": ["Event-Driven Architecture", "Publish-Subscribe Architecture", "Layered Architecture", "Component-Based Architecture"],
    "answer": 0
  },
  {
    "title": "Which architectural style focuses on creating self-contained, independent components with explicit boundaries and contracts?",
    "options": ["Monolithic Architecture", "Service-Oriented Architecture (SOA)", "Event-Driven Architecture", "Layered Architecture"],
    "answer": 1
  },
  {
    "title": "What is the primary goal of the microservices architectural style?",
    "options": ["To create monolithic applications", "To centralize application logic", "To establish strong data consistency", "To decompose a system into independent services"],
    "answer": 3
  },
  {
    "title": "Which architectural style emphasizes the separation of concerns by dividing an application into layers such as presentation, business logic, and data access?",
    "options": ["MVC (Model-View-Controller)", "REST (Representational State Transfer)", "SOA (Service-Oriented Architecture)", "Microservices"],
    "answer": 0
  },
  {
    "title": "What does REST stand for in the context of web services?",
    "options": ["Representational State Transfer", "Remote Execution and Service Testing", "Responsive Encoding and Stateless Transmission", "Reliable Endpoint Security and Tracking"],
    "answer": 0
  },
  {
    "title": "Which of the following is NOT a constraint of REST architecture?",
    "options": ["Client-server architecture", "Uniform interface", "Stateless communication", "Session management"],
    "answer": 3
  },
  {
    "title": "In a RESTful API, what is the purpose of the 'Resource' component?",
    "options": ["To define the available actions on the server", "To store and manage data", "To provide authentication and authorization", "To represent a specific entity or concept"],
    "answer": 3
  },
  {
    "title": "What does HATEOAS stand for in the context of RESTful APIs?",
    "options": ["Hypermedia As The Engine Of Application State", "Hypertext And Transfer Exchange Over API Services", "HTTP Authorization Technique For Easy Object Serialization", "Heuristic Approach To Endpoint Orchestration And Security"],
    "answer": 0
  },
  {
    "title": "Which of the following is NOT a widely used version control system for tracking changes in source code?",
    "options": ["Perforce", "SVN", "Mercurial", "Dropbox"],
    "answer": 3
  },
  {
    "title": "What is the purpose of a package manager in backend software development?",
    "options": ["To manage dependencies and libraries", "To debug code and fix issues", "To create user interfaces", "To handle network requests"],
    "answer": 0
  },
  {
    "title": "Which database management system is known for its document-oriented approach and flexibility?",
    "options": ["MongoDB", "MySQL", "PostgreSQL", "Oracle"],
    "answer": 0
  },
  {
    "title": "What is the purpose of an API documentation tool in backend development?",
    "options": ["To analyze code complexity", "To generate code from design specifications", "To provide reference documentation for developers", "To automate code deployment"],
    "answer": 2
  },
  {
    "title": "Which tool is commonly used for benchmarking and load testing web applications?",
    "options": ["Apache JMeter", "Selenium", "Postman", "Cucumber"],
    "answer": 0
  },
  {
    "title": "What is the purpose of an Object-Relational Mapping (ORM) tool in backend development?",
    "options": ["To manage database schema migrations", "To handle asynchronous operations", "To optimize database queries", "To facilitate the mapping between database records and objects"],
    "answer": 3
  },
  {
    "title": "What is the purpose of a message broker in a backend architecture?",
    "options": ["To manage authentication and authorization", "To handle client-side routing", "To facilitate communication between distributed components", "To monitor application performance"],
    "answer": 2
  }
]